app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "banned" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["banned", "t"], ["updated_at", "2015-02-22 21:26:29.447540"]]
---
  def toggle_banned
    user = User.find(params[:id])
    user.update_attribute :banned, (not user.banned)